Revit 2027 API
BuiltInFailures.PropertySetElementFailures.NonUniquePropertySetName Property
 The value of the given parameter is already in use as a property set name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonUniquePropertySetName { get; }
Public Shared ReadOnly Property NonUniquePropertySetName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonUniquePropertySetName {
	FailureDefinitionId^ get ();
}
static member NonUniquePropertySetName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PropertySetElementFailures Class
Autodesk.Revit.DB Namespace